Repository: nerdneilsfield/pandoc-ui
Catalog: pandoc_ui/locales/*/LC_MESSAGES/pandoc_ui.po
Languages: de_de, es_es, fr_fr, ja_jp

source: # No conversion profile or files selected
de_de: # Kein Konvertierungsprofil oder Dateien ausgewählt
es_es: # No hay perfil de conversión o archivos seleccionados
fr_fr: # Aucun profil de conversion ou fichier sélectionné
ja_jp: # 変換プロファイルまたはファイルが選択されていません

source: .md,.rst,.txt (leave empty for auto-detect)
de_de: .md,.rst,.txt (leer lassen für Auto-Erkennung)
es_es: .md,.rst,.txt (dejar vacío para auto-detectar)
fr_fr: .md,.rst,.txt (laisser vide pour auto-détecter)
ja_jp: .md,.rst,.txt（空白で自動検出）

source: Add custom pandoc arguments (e.g., --metadata title="My Title" --toc):
de_de: Benutzerdefinierte pandoc-Argumente hinzufügen (z.B. --metadata title="Mein Titel" --toc):
es_es: Agregar argumentos pandoc personalizados (ej: --metadata title="Mi Título" --toc):
fr_fr: Ajouter des arguments pandoc personnalisés (ex: --metadata title="Mon Titre" --toc):
ja_jp: カスタムpandoc引数を追加（例：--metadata title="私のタイトル" --toc）：

source: Additional arguments to append to the pandoc command
de_de: Zusätzliche Argumente für den pandoc-Befehl
es_es: Argumentos adicionales para agregar al comando pandoc
fr_fr: Arguments supplémentaires à ajouter à la commande pandoc
ja_jp: pandocコマンドに追加する追加引数

source: Batch Options
de_de: Stapeloptionen
es_es: Opciones de lote
fr_fr: Options de lot
ja_jp: バッチオプション

source: Clear Log
de_de: Log löschen
es_es: Limpiar registro
fr_fr: Effacer le log
ja_jp: ログクリア

source: Clear custom arguments
de_de: Benutzerdefinierte Argumente löschen
es_es: Limpiar argumentos personalizados
fr_fr: Effacer les arguments personnalisés
ja_jp: カスタム引数をクリア

source: Command Preview
de_de: Befehlsvorschau
es_es: Vista previa del comando
fr_fr: Aperçu de la commande
ja_jp: コマンドプレビュー

source: Command for single file conversion:
de_de: Befehl für Einzeldateikonvertierung:
es_es: Comando para conversión de archivo único:
fr_fr: Commande pour conversion de fichier unique:
ja_jp: 単一ファイル変換コマンド：

source: Configuration Profiles
de_de: Konfigurationsprofile
es_es: Perfiles de configuración
fr_fr: Profils de configuration
ja_jp: 設定プロファイル

source: Custom Arguments
de_de: Benutzerdefinierte Argumente
es_es: Argumentos personalizados
fr_fr: Arguments personnalisés
ja_jp: カスタム引数

source: Delete selected profile
de_de: Ausgewähltes Profil löschen
es_es: Eliminar perfil seleccionado
fr_fr: Supprimer le profil sélectionné
ja_jp: 選択したプロファイルを削除

source: Enter custom pandoc arguments...
de_de: Benutzerdefinierte pandoc-Argumente eingeben...
es_es: Ingresar argumentos pandoc personalizados...
fr_fr: Entrer des arguments pandoc personnalisés...
ja_jp: カスタムpandoc引数を入力...

source: Error generating command preview
de_de: Fehler beim Generieren der Befehlsvorschau
es_es: Error al generar vista previa del comando
fr_fr: Erreur lors de la génération de l'aperçu de commande
ja_jp: コマンドプレビュー生成エラー

source: File Extensions:
de_de: Dateierweiterungen:
es_es: Extensiones de archivo:
fr_fr: Extensions de fichier:
ja_jp: ファイル拡張子：

source: Folder (Batch)
de_de: Ordner (Stapel)
es_es: Carpeta (Lote)
fr_fr: Dossier (Lot)
ja_jp: フォルダ（バッチ）

source: Input Selection
de_de: Eingabeauswahl
es_es: Selección de entrada
fr_fr: Sélection d'entrée
ja_jp: 入力選択

source: Invalid argument format: %s
de_de: Ungültiges Argumentformat: %s
es_es: Formato de argumento inválido: %s
fr_fr: Format d'argument invalide: %s
ja_jp: 無効な引数形式：%s

source: Invalid argument format: {e}
de_de: Ungültiges Argumentformat: {e}
es_es: Formato de argumento inválido: {e}

source: Language:
de_de: Sprache:
es_es: Idioma:
fr_fr: Langue:
ja_jp: 言語：

source: Load Snapshot
de_de: Schnappschuss laden
es_es: Cargar instantánea
fr_fr: Charger l'instantané
ja_jp: スナップショット読み込み

source: Load selected profile configuration
de_de: Ausgewählte Profilkonfiguration laden
es_es: Cargar configuración del perfil seleccionado
fr_fr: Charger la configuration du profil sélectionné
ja_jp: 選択したプロファイル設定を読み込み

source: Log Output
de_de: Log-Ausgabe
es_es: Salida de registro
fr_fr: Sortie de log
ja_jp: ログ出力

source: Max Files:
de_de: Max. Dateien:
es_es: Archivos máximos:
fr_fr: Fichiers max:
ja_jp: 最大ファイル数：

source: No files selected.
de_de: Keine Dateien ausgewählt.
es_es: No hay archivos seleccionados.
fr_fr: Aucun fichier sélectionné.
ja_jp: ファイルが選択されていません。

source: Output Directory:
de_de: Ausgabeverzeichnis:
es_es: Directorio de salida:
fr_fr: Répertoire de sortie:
ja_jp: 出力ディレクトリ：

source: Output Format:
de_de: Ausgabeformat:
es_es: Formato de salida:
fr_fr: Format de sortie:
ja_jp: 出力フォーマット：

source: Output Settings
de_de: Ausgabeeinstellungen
es_es: Configuración de salida
fr_fr: Paramètres de sortie
ja_jp: 出力設定

source: Output directory (leave empty for same as input)
de_de: Ausgabeverzeichnis (leer lassen für gleich wie Eingabe)
es_es: Directorio de salida (dejar vacío para igual que entrada)
fr_fr: Répertoire de sortie (laisser vide pour identique à l'entrée)
ja_jp: 出力ディレクトリ（空白で入力と同じ）

source: Pandoc UI - Document Converter
de_de: Pandoc UI - Dokumentkonverter
es_es: Pandoc UI - Convertidor de documentos
fr_fr: Pandoc UI - Convertisseur de documents
ja_jp: Pandoc UI - ドキュメントコンバーター

source: Pandoc not available
de_de: Pandoc nicht verfügbar
es_es: Pandoc no disponible
fr_fr: Pandoc non disponible
ja_jp: Pandoc利用不可

source: Preview of pandoc command that will be executed:
de_de: Vorschau des auszuführenden pandoc-Befehls:
es_es: Vista previa del comando pandoc que se ejecutará:
fr_fr: Aperçu de la commande pandoc qui sera exécutée:
ja_jp: 実行されるpandocコマンドのプレビュー：

source: Progress
de_de: Fortschritt
es_es: Progreso
fr_fr: Progrès
ja_jp: 進行状況

source: Ready - Pandoc available
de_de: Bereit - Pandoc verfügbar
es_es: Listo - Pandoc disponible
fr_fr: Prêt - Pandoc disponible
ja_jp: 準備完了 - Pandoc利用可能

source: Recursive (All Subfolders)
de_de: Rekursiv (Alle Unterordner)
es_es: Recursivo (Todas las subcarpetas)
fr_fr: Récursif (Tous les sous-dossiers)
ja_jp: 再帰的（全サブフォルダ）

source: Sample command for batch conversion (%d files):
de_de: Beispielbefehl für Stapelkonvertierung (%d Dateien):
es_es: Comando de muestra para conversión por lotes (%d archivos):
fr_fr: Exemple de commande pour conversion par lot (%d fichiers):
ja_jp: バッチ変換サンプルコマンド（%dファイル）：

source: Sample command for batch conversion ({len(self.current_input_files)} files):
de_de: Beispielbefehl für Stapelkonvertierung ({len(self.current_input_files)} Dateien):
es_es: Comando de muestra para conversión por lotes ({len(self.current_input_files)} archivos):

source: Save Snapshot
de_de: Schnappschuss speichern
es_es: Guardar instantánea
fr_fr: Sauvegarder l'instantané
ja_jp: スナップショット保存

source: Save current configuration as a profile
de_de: Aktuelle Konfiguration als Profil speichern
es_es: Guardar configuración actual como perfil
fr_fr: Sauvegarder la configuration actuelle comme profil
ja_jp: 現在の設定をプロファイルとして保存

source: Scan Mode:
de_de: Scan-Modus:
es_es: Modo de escaneo:
fr_fr: Mode de scan:
ja_jp: スキャンモード：

source: Select a saved configuration profile
de_de: Gespeichertes Konfigurationsprofil auswählen
es_es: Seleccionar un perfil de configuración guardado
fr_fr: Sélectionner un profil de configuration sauvegardé
ja_jp: 保存された設定プロファイルを選択

source: Select input file or folder to convert...
de_de: Eingabedatei oder -ordner zum Konvertieren auswählen...
es_es: Seleccionar archivo o carpeta de entrada para convertir...
fr_fr: Sélectionner le fichier ou dossier d'entrée à convertir...
ja_jp: 変換する入力ファイルまたはフォルダを選択...

source: Select interface language
de_de: Oberflächensprache auswählen
es_es: Seleccionar idioma de interfaz
fr_fr: Sélectionner la langue de l'interface
ja_jp: インターフェース言語を選択

source: Single File
de_de: Einzelne Datei
es_es: Archivo único
fr_fr: Fichier unique
ja_jp: 単一ファイル

source: Single Level Only
de_de: Nur eine Ebene
es_es: Solo un nivel
fr_fr: Un seul niveau
ja_jp: 単一レベルのみ

source: Start Conversion
de_de: Konvertierung starten
es_es: Iniciar conversión
fr_fr: Démarrer la conversion
ja_jp: 変換開始

source: This command will be executed for each of the %d selected files
de_de: Dieser Befehl wird für jede der %d ausgewählten Dateien ausgeführt
es_es: Este comando se ejecutará para cada uno de los %d archivos seleccionados
fr_fr: Cette commande sera exécutée pour chacun des %d fichiers sélectionnés
ja_jp: このコマンドは選択された %d 個のファイルそれぞれに対して実行されます
